Revit 2027 API
CompoundStructure.OpeningWrapping Property
 Indicates the opening wrapping condition defining which shell layers of a wall, in plan view, wrap at inserts and openings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OpeningWrappingCondition OpeningWrapping { get; set; }
Public Property OpeningWrapping As OpeningWrappingCondition
	Get
	Set
public:
property OpeningWrappingCondition OpeningWrapping {
	OpeningWrappingCondition get ();
	void set (OpeningWrappingCondition value);
}
member OpeningWrapping : OpeningWrappingCondition with get, set
Property Value
OpeningWrappingCondition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace